import { Header } from "../../Header/Header"
import css from "./Privacy.module.css"

export function Privacy() {
    return (
        <>
            <section className={css.hero}>
                <Header />
                <div>
                    <div className={css.privacy}>
                        <div className={css.privacy_info}>
                            Політика конфіденційності
                        </div>
                        <div className={css.lock}>

                        </div>
                        <div className={css.privacy_content_top}>
                            У цій політиці ви часто зустрічатимете термін "особисті дані". Цей термін означає будь-яку інформацію, за допомогою якої можна ідентифікувати вашу особу. Це може бути інформація, яка самостійно вас ідентифікує, наприклад ваше ім’я, контактна інформація, маршрут подорожі, IP-адреса, рядки файлів cookie або ідентифікатори пристрою. Або це може бути така інформація, що не ідентифікує вас безпосередньо, але яку ми зберігаємо разом із вашими іншими ідентифікаторами. Наприклад, ми зберігаємо інформацію про те, як ви використовуєте наші послуги, з якої країни ви їх використовуєте та в який час. <br /><br />

                            Ми відповідаємо тільки за себе, тому ця політика не стосується збору чи використання вашої інформації авіакомпаніями, онлайновими туристичними агенціями, готелями, компаніями, що здають в оренду автомобілі, чи іншими туристичними компаніями (назвімо їх "Постачальники туристичних послуг"), представленими на нашому сайті. Це означає, що коли ви бронюєте послугу в Постачальника туристичних послуг.
                        </div>
                        <div className={css.privacy_content_center}>
                            Цей постачальник оброблятиме вашу інформацію відповідно до власних політики конфіденційності та умов і положень. Але не хвилюйтеся, ми завжди надаємо вам посилання на ці політики та умови й положення, щоб ви могли прочитати їх, перш ніж бронювати послугу.
                        </div>
                        <div className={css.privacy_content_bottom}>
                            <div className={css.common}></div>
                            <div>
                                <ul className={css.list}>
                                    <li className={css.font}>
                                        Ми використовуємо вашу інформацію, лише якщо ви дали нам на це згоду, якщо інформація необхідна для надання послуг, які ви запитували, якщо це необхідно для реалізації законних прав або виконання законних обов’язків, або для звичайних бізнес-цілей, визначених у цій політиці. <br /><br />

                                        Ми робимо це, коли нам потрібно надати вам доступ до наших послуг або спростити виконання договору, який ви уклали або укладаєте, наприклад коли ви бронюєте послугу в нас або в Постачальника туристичних послуг. <br /><br />

                                        Для покращення чи оптимізації наших послуг або захисту чи просування наших законних інтересів. Цей приклад включає в себе досить серйозні причини, як-от запобігання шахрайству та безпека, а також приємні речі, наприклад удосконалення продукту, щоб мандрівникам було ще зручніше використовувати TripPlanner. <br /><br /><br /><br />
                                    </li>
                                    <li className={css.font}>
                                        Ми збираємо, зберігаємо та обробляємо певну інформацію про кожну людину, яка користується нашими послугами. Проте ми не збираємо більше інформації, ніж потребуємо. <br /><br />

                                        Інформація, яку ви надаєте нам, може містити особисті дані, необхідні для бронювання подорожей для вас та інших пасажирів. Ця інформація може містити різні дані, від дати та місця призначення подорожі, які ви обираєте під час пошуку, до основних реквізитів для оформлення бронювання на сайті Постачальника туристичних послуг, наприклад імена та контактні дані. Вона також може включати такий вміст, як відгуки чи фотографії, які ви завантажуєте на сайт наших послуг, щоб поділитися ними з іншими користувачами. Найголовніше – тільки ви вирішуєте, чи ви хочете надавати нам таку інформацію. <br /><br />

                                        Ми автоматично генеруємо або збираємо певну інформацію з вашого комп’ютера або пристрою, коли ви користуєтеся нашими послугами. Ця інформація містить такі дані, як ваша IP-адреса, інформація про пристрій і веб-браузер, які ви використовуєте для доступу до наших послуг, URL-адреса сайту, з якого ви до нас перейшли, і сторонні сайти, на які ви переходите, коли вибираєте посилання на сайті Skyscanner. Ця інформація також містить деталі про бронювання, яке ви зробили через сайт Skyscanner. Ми також можемо визначити ваше розташування за допомогою вашого мобільного пристрою або вашої IP-адреси. Це допомагає нам покращити ваш досвід користування нашими послугами та відображати для вас вміст, який може вас зацікавити. <br /><br />

                                        Інколи ми отримуємо інформацію про вас від третіх сторін залежно від того, як ви вирішили взаємодіяти з нами. Наприклад, це відбувається, коли ви переходите на наш сайт від партнера, що нас рекламує, або входите у свій обліковий запис Skyscanner, використовуючи функцію входу через соціальну мережу. Якщо ви забронювали послугу в Постачальника туристичних послуг, ми можемо збирати від нього інформацію про те, чи ви завершили бронювання, що саме ви забронювали та чи бронювання було успішним. Ми також можемо збирати інформацію про вас від постачальників послуг із запобігання шахрайству, з якими співпрацюємо, щоб запобігти зловживанню вашими особистими даними. <br /><br />

                                        Наші послуги не призначені для дітей молодше 16 років. Особам молодше 16 років заборонено надавати інформацію в наші служби або за їх допомогою. Ми свідомо не збираємо особисті дані від дітей віком до 16 років. Ми видалимо зібрані й отримані дані, якщо дізнаємося, що їх не надано одним із батьків дитини чи законним опікуном або безпосередньо уповноваженим ними користувачем. <br /><br /><br />
                                    </li>
                                    <li className={css.font}>
                                        Ми зберігаємо ваші дані, лише доки ми цього потребуємо або доки від нас цього вимагає закон. Потім ми видаляємо ваші дані або анонімізуємо їх, щоб вас не можна було ідентифікувати за ними. Ми поводимося з даними відповідно до цілі, для якої вони використовуються. Проте ви можете в будь-який час попросити нас видалити їх. <br /><br />

                                        Ми зберігаємо ваші особисті дані, доки вони нам потрібні. Це залежить від цілей, для яких дані зібрано, або від того, чи ми маємо постійну законну підставу для збереження даних (наприклад, виконання договору між нами, надання послуги, яку ви запитали, або для реалізації наших законних інтересів). Будьте впевнені, якщо у нас більше немає підстав або законної необхідності обробляти ваші особисті дані, ми їх видаляємо або зберігаємо їх таким чином, щоб за ними неможливо було вас ідентифікувати. <br /><br />

                                        Крім того, якщо у вас є обліковий запис на нашому сайті, ми зберігатимемо такі особисті дані, як ваша електронна адреса, ім’я, та іншу інформацію, щоб ви могли увійти в систему та отримати доступ до наших послуг, стільки часу, скільки існуватиме ваш обліковий запис. Ми можемо зберігати іншу інформацію протягом невизначеного терміну, наприклад дії на сайті, пов’язані з IP-адресою. Ця інформація допомагає нам зрозуміти наших користувачів, вдосконалювати наші продукти та послуги, а також захищати наші бізнес-інтереси. <br /><br /><br />
                                    </li>
                                    <li className={css.font}>
                                        Ми надаємо доступ до вашої інформації, лише коли ви нас просите про це, якщо це необхідно для співпраці з вами та надання вам послуг, або якщо від нас цього вимагає закон. Компанії, послуги яких ви бронюєте через Skyscanner (наприклад, авіакомпанії або готелі), збиратимуть ваші дані відповідно до їхніх власних політик. Іноді компанії, які рекламуються через наші послуги, також можуть збирати вашу інформацію. Крім того, компанії, які допомагають нам надавати послуги, також збиратимуть та використовуватимуть ваші дані від нашого імені. <br /><br />
                                    </li>
                                    <li className={css.font}>
                                        Безпека ваших особистих даних – наш найвищий пріоритет. Доступ до ваших даних мають тільки працівники групи Skyscanner, яким потрібна ця інформація для виконання службових обов’язків і надання наших послуг. <br /><br />

                                        На жаль, жоден сайт або додаток не гарантують повної безпеки, але ми створили програму безпеки, яка застосовується у всій нашій організації та яка дає змогу максимально безпечно зберігати ваші особисті дані. У цій програмі застосовується ряд технічних, організаційних і адміністративних заходів безпеки та найкращих технік з урахуванням типу даних, які обробляються. Наприклад, комп’ютерні системи, на яких ми зберігаємо ваші дані, мають обмеження доступу та використовують сервери на базі хмарних технологій, на яких застосовується шифрування дисків галузевого стандарту. Ми використовуємо протоколи шифрування TLS і HTTPS для захисту ваших особистих даних під час їх передачі через Інтернет. Ми також проводимо оцінки безпеки Сторонніх обробників даних, які обробляють ваші дані. <br /><br />

                                        Щоб підтримувати культуру свідомої конфіденційності, ми проводимо навчання з ретельного захисту даних і конфіденційності для всіх працівників групи Skyscanner. Ми розробляємо наші послуги таким чином, щоб для їхнього використання був потрібен мінімальний обсяг особистих даних, зокрема завдяки використанню техніки мінімізації даних, як-от анонімізація та псевдонімізація. Крім того, якщо розробка чи оновлення наших послуг вимагають збору чи використання нових форм особистих даних, ми проводимо оцінку впливу на конфіденційність, щоб зрозуміти та зменшити ймовірність будь-якого небажаного впливу на вас. <br /><br /><br /> <br /> <br />
                                    </li>
                                    <li className={css.font}>
                                        Ми зберігаємо вашу інформацію на захищених серверах у різних розташуваннях, залежно від того, де ви перебуваєте, коли відкриваєте наш сайт. Зараз ми використовуємо сервери, які розташовані в Нью-Йорку, Мюнхені, Токіо, Сінгапурі та Торонто. Ці сервери надаються та/або обслуговуються третіми сторонами, які діють згідно з нашими інструкціями (додаткову інформацію див. у розділі Коли вашу інформацію збирають треті сторони або отримують доступ до неї?). <br /><br />

                                        Іноді країни, в які передаються ваші дані або в яких вони зберігаються, можуть мати інші або менш суворі стандарти захисту та безпеки, ніж у вашій країні. Проте за умови дотримання місцевих законів у цих країнах ми забезпечимо гарантії, необхідні для захисту ваших даних незалежно від розташування. Щоб зробити це, ми поєднуємо відповідні технічні, організаційні й адміністративні заходи безпеки та створюємо необхідні законні умови для підтримки цих вимог. Наприклад, ми зберігаємо особисті дані європейських користувачів за межами Європейського економічного простору тільки в країнах, які використовують для затвердження передачі даних методи, схвалені Європейською Комісією. <br /><br />

                                        Якщо у вас виникли питання щодо кроків, які ми вживаємо для захисту ваших особистих даних, зв’яжіться з нами, використовуючи інформацію, доступну в цій Політиці конфіденційності (див. розділ "Хто ми та як із нами зв’язатися?"). <br /><br /><br />
                                    </li>
                                    <li className={css.font}>
                                        Файл cookie – це невеликий файл даних, який зберігається на вашому комп’ютері або на пристрої. Файли cookie записують інформацію, наприклад ваші налаштування та параметри, і надають нам інформацію, за допомогою якої ми забезпечуємо вам відповідний досвід використання. Ми також використовуємо файли cookie для запису інформації про експерименти або вдосконалення, які ми можемо перевірити, щоб спостерігати, як ви використовуєте наші послуги, і дізнатися, чи вони є ефективними.
                                        Файли cookie на нашому сайті можуть належати нам, третім сторонам, з якими ми співпрацюємо, і незалежним третім сторонам, наприклад рекламодавцям. <br /><br />

                                        Веб-маяки або пікселі – це невеликі прозорі файли зображень на веб-сторінці або в електронному листі. Ми використовуємо їх, щоб дізнатися, як ви користуєтеся нашими послугами, або дізнатися, чи ви перейшли на сайт або в додаток Постачальника туристичних послуг. Ми можемо використовувати піксель, щоб переконатися, що ви забронювали послугу в Постачальника туристичних послуг, і дізнатися, що саме ви забронювали. Ми також використовуємо пікселі, щоб дізнатися, чи ви відкрили електронний лист, щоб удосконалити нашу комунікацію з вами. <br /><br />

                                        Коди відстеження – це фрагменти коду, розміщені на сторінці. Вони вимірюють відвідування та взаємодію. Ми використовуємо коди відстеження, щоб дізнатись, як ви взаємодієте з нашими послугами, рекламними оголошеннями, які ви бачите, і як ви взагалі використовуєте Skyscanner. <br /><br /><br />
                                    </li>
                                    <li className={css.font}>
                                        Ви маєте право вимагати від нас копію своїх особистих даних, виправляти, видаляти або обмежувати обробку своїх особистих даних і отримати особисті дані, які ви нам надали, у структурованому вигляді та машинозчитуваному форматі. Крім того, ви можете заборонити обробку своїх даних за деяких обставин (зокрема, якщо ми не повинні обробляти дані, щоб виконати договірні або інші законні вимоги). Якщо ми просили вас про згоду, ви можете відкликати її будь-коли. Якщо ви попросите відкликати свою згоду на обробку своїх даних компанією Skyscanner, це не вплине на обробку, яка вже відбулася на час вашого запиту. <br /><br />

                                        Ці права можуть бути обмеженими, наприклад, якщо для виконання вашого запиту будуть розкриті особисті дані іншої особи або якщо ви запитаєте нас про видалення інформації, яку від нас вимагає закон або для збереження якої ми маємо переконливі законні підстави. Якщо у вас є невирішені запитання, ви маєте право подати скаргу до органу захисту даних. <br /><br /><br />
                                    </li>
                                </ul>
                                <div className={css.cookie}>
                                    Якщо у вас є запитання щодо цієї політики або ви хотіли б дізнатися більше про файли cookie, які використовуються на наших вебсайтах
                                </div>
                            </div>
                            <a href="/TriPlanner">
                                <div className={css.buttonlink}>

                                </div>
                            </a>
                        </div>
                    </div>
                </div>
            </section>
        </>
    )
}